<PAD>
<UNK>
g1f3
g8f6
d2d4
e1g1
e8g8
b1c3
e2e4
e7e6
b8c6
d7d5
g7g6
c2c4
c7c5
g2g3
h2h3
a7a6
d7d6
h7h6
f8g7
c7c6
e7e5
c2c3
f8e7
e2e3
b8d7
f1e1
f7f6
c5d4
f8e8
f2f3
e4e5
b7b6
a2a4
b2b3
a2a3
f2f4
f1e2
f6e4
f3e5
f1d3
e6d5
b7b5
f1g2
f3d4
a8c8
c4d5
c1e3
h2h4
e4d5
f7f5
b1d2
a7a5
d1d2
e6e5
h7h5
b2b4
g8g7
f6d5
c8b7
d4d5
c8e6
c1f4
d2d3
a1c1
g3g4
e3d4
h4h5
g2g4
g7f6
c1g5
c8d7
d4e5
a1d1
f4f5
d8d7
d8c7
a5a4
d5e4
g6g5
c3d5
d6e5
e5e4
b7c6
c8f5
g1g2
e5d4
g4g5
b5b4
d1e2
h5h4
d5d4
f4e5
e1c1
f7e6
f1d1
b2c3
c3e4
c6c5
g2f3
c8g4
d4c5
a4a5
d5c4
e7f6
h3h4
a8d8
c4c5
f3f4
d8e7
b4b5
f1c4
c1d2
f6d7
a6a5
d6d5
a8b8
c6d5
e3e4
e7d6
f5f4
g8h8
f8d6
c5c4
f8d8
d1c2
h6h5
c1b2
c6d4
g8h7
g1h1
g5f6
d8b6
g1f1
d7e5
b6b5
c3d4
b3b4
a1b1
e2f3
g7g5
g1f2
f6f5
c3c4
f2e3
f1b5
f5e4
g5g4
g8f8
e6f5
d7c6
d3e4
f3d2
g8f7
c1b1
e5e6
g5f4
e5f4
g1h2
f6e5
c6e5
e2d3
f8c5
e8c8
f8b4
d7c5
d4d3
d1d4
f5f6
e4f5
d1f3
e3f4
e8e7
g3f4
h8g8
f3e4
d3d4
g4f3
d1c1
a1e1
d8e8
h7g6
g8e7
g4f5
a4a3
b5c6
c4b3
e1e2
a6b5
b4c3
e8d8
a8e8
g5h4
g6f5
d5d6
d3c4
d7f6
f3g5
d1d3
a3a4
c3e2
d1b3
f4g5
h4h3
d6c5
e4e3
c6e7
h5g6
d6d7
h1g1
g7f8
d1e1
f5g6
h5h6
f6g5
h3g4
d7b6
d2c4
f5e6
a5a6
a4b5
d8d5
e5f6
d8c8
f8c8
c8c7
f4g3
h2g3
g4h5
c5c6
c5b6
h6g5
h5g4
f4e3
f5g4
d2e4
g7h6
b6c5
g1e2
d8a5
c1c2
f8f7
h4g3
e1d1
d6e7
c3b5
f6g4
d2c3
e5d6
d7e6
f2g3
d8d6
c6a5
d2e3
a3a2
c8b8
d8f6
h4g5
d4c3
f3e2
f3h4
f1g1
c4c3
e8f8
f6e7
f3g3
h3h2
g5g6
c7d6
d5e6
f3g4
c2d3
f7g6
e6e7
f4f3
b5b6
c8d8
d3c2
f6e6
d2f3
g2h3
e3e2
c1d1
e2f1
e1f1
f6f7
c5d6
c4b5
b3c4
d3e2
e8f7
f6g6
d5c6
g4g3
e2d2
f6h5
f1f2
a3b4
e4c3
e4f6
b6b7
a4b3
a6a7
b4b3
d2c2
d3c3
c2b3
g6h5
e3d2
e6d7
c2d2
e6f7
c3b4
a5b4
e4d3
c3a4
b5c4
g6g7
e7c5
b5a4
d2e2
e7f8
f1c1
e6d6
e4f3
d1d8
e7d7
f3e3
c6c7
d3d2
f6g7
e8d7
g7g8
c7b6
e3d3
b4c5
e2f4
e7g6
e5c6
e4d6
g7e5
c3c2
c5b4
g2f1
d2b3
d4c6
c4d3
d7e8
e3f2
d6c7
h6g7
c6b5
b3c2
d1d5
f2e2
f8g8
g7f7
f7e7
c6b4
e7f5
c7d7
e7f7
c8a6
d7c7
e7d8
b2a3
e3f3
g3h4
d8d4
e2g3
b3b2
e1e3
d7f8
b6d5
c2b2
d7e7
d2f4
e8e6
c7b7
b8c8
e5c4
e5f3
g5h6
f7g7
d4e3
e5d3
h6h7
e2f2
d4b3
h8h7
b6c7
h1h2
b1c1
d3f5
g3g2
e2c4
d4e4
d5b6
d5f4
e7e8
a2b3
f4d6
b1a1
g6f6
d6e6
a5b6
d5c3
h1e1
e2d1
d1f1
d5f6
h7g8
g6f7
a1a2
d1a4
a7b6
a8a7
d8d1
e4c5
e4d4
e6f6
e1d2
e1e4
e7d5
c5e4
b7a6
e4g5
g7h7
b8a8
g2e4
d6c6
e7g5
c3d3
d4f5
d7c8
b8b7
f6e8
b7d5
g7d4
d8f8
b4a5
f3f2
h7g7
g4h3
h2g2
c8c5
d4b5
f5e5
h2g1
d2f1
h3g3
e5d7
g3h3
c7c8
f2g2
h1d1
f4e4
h3g2
b2a2
c8c2
g3f3
c5d3
g5e3
b8a6
d3e3
e5d5
c6b6
e1f2
h1g2
e3c5
e4f4
g4h4
d5c5
b6a5
e5f5
f7e8
f4g4
f7g8
e7c6
d1g4
b2d4
h8e8
g2h2
d1d7
f3e1
g4f4
e6c4
d1d6
c5e7
g3f2
g6h6
f7f8
f8b8
g2f2
h7h8
e2g4
b3c5
d6f4
f3g2
e1e5
g5f5
b6c6
c4e3
c1a3
c6d6
b3a3
c2e2
c4e5
h5f4
a5c4
d5e5
b7c7
g4e2
c7d8
e7b4
d7f5
d5e7
a6b7
h8g7
e8e5
d4c4
d7d8
e3g5
d3b5
c8c4
g5e4
b1b2
c8c6
b6a6
a7a8
b3d5
b3a4
a1a3
h2h1
a4c5
d7b5
c3d2
a5c6
b2c1
e6g4
c6d7
b8d8
c3b3
c5e6
d1b1
e5g4
a2a1
d2g5
e2h5
f5g5
b2b1
c4d4
d1a1
f5d3
b5d3
b7a7
h8d8
g4e6
f4e6
d8g5
e4d2
d4f3
e2d4
e5g6
g5f3
b7c8
e1e8
b1c2
b2c2
a8f8
e8e4
b5a6
g6f4
g4e5
f1f3
f4d3
c1c7
c7e5
d8d3
b4a3
b6d4
h8f8
d8h4
c7e7
d4d2
b5d6
d5e3
d2e1
e8e1
c1c3
d2f2
e2b5
c2d1
c5d5
f2e1
g2d5
f3d5
d4e6
c3b2
f5d4
a3b3
h4g4
g2g1
b4c4
c8c1
b1a3
d8g8
b4e7
c1c5
e2e1
b7e4
a1f1
g5e6
d6f5
b3d4
d3f1
d3c5
d2d1
d8a8
d1h5
d8d2
b5c3
e6f4
a5c7
e2c3
c6b7
c1c4
b4d3
e8e2
c1a1
c4e2
a7b7
g5e7
e2c2
b3c3
f8f6
h4f5
d2b4
h5g5
e4g3
b6c4
b6d7
b1a2
d4f6
c8a8
g3h2
b4d2
h6g6
c1c8
g4f6
d8b8
f4d2
d7f7
g5h5
f1b1
b7b8
b8b2
d4b6
f2f1
f8e6
c8e8
g6h7
c7b8
h4g6
c2e4
e3f5
b5d7
f8a8
c4b4
e3d5
b8c7
d4e2
e8d6
d6c4
c4d6
g3h5
c5e3
e3h6
f3h2
f1f4
d3f3
g6e7
d2c1
b5d4
c2c1
a5c5
a8a5
f4c7
g3e4
b5a5
e8b8
h4f3
g3f5
b8a7
c1c6
h1f1
d3f4
b7f3
d2b2
b6d8
h4f6
b1d1
a3b2
d5f3
e1e6
c5b5
b4a4
b8b6
e6d4
e7h4
e3b6
d5b4
c5b3
f4h2
c5c7
a6c5
f6d4
b1e1
d4g7
d6g3
e5e7
b4d6
f5d7
f4d5
a2b2
a4b4
b6b2
f4h3
c2b1
c1e1
g5d2
d5c7
e7c7
c7a7
c3d1
c5d7
b1b3
a4c3
c1h6
a8g8
c8c3
g8h6
c4e6
b3b6
a1a6
g2c6
d6e4
g2h1
g7h8
b5c5
f1a1
d6b4
a4c2
d7b7
d3e5
a5b5
f8h8
b7a8
h5g3
b1b7
b8b5
c8f8
e5g3
a1a8
f6h7
f8f5
e1b1
c6e4
c2f2
f5e3
b4b2
a8a6
a6c8
f5d6
e3e5
c7f4
b2a1
a4c6
h5f6
e1a1
a1a5
a8a1
d5d1
b3d1
b5e2
c2f5
g7g8q
f3d1
e4e2
a2c2
b8b4
c3b1
c7e6
f5e7
f8f4
e8a8
d7a4
e3c4
b4d5
a1b2
d4f4
c2c6
d7d4
e6b3
c7a5
c4e4
e4b7
a5a3
b4c6
h4f4
g4e3
b3d2
d3g6
d1g1
a1a4
d7g4
a8a2
a2b1
a4b6
e5c7
f5h7
e7a3
c2c5
h2h1q
c5f2
b6b8
g5f7
h5f5
f1h3
h8h5
e8e3
a6c7
b8e8
d6f8
c5e5
g6e5
d1h1
a6b6
f1h1
a5b7
b5c7
f4h5
f6h4
c7f7
c6d8
d3b1
h3f4
a4c4
e3a7
f3f5
e1e7
e1d3
a1a7
e5g5
c4b6
c5a7
d7b8
d5f5
c7c4
h8c8
e3g3
c3e3
b6b4
f6f4
f8h6
d4b2
e8c6
d4h4
f1g3
c6c4
f2g1
a2a1q
d4d6
e3g4
f5c2
c2e3
c4d2
c4c2
f5h4
h5f3
h1h3
h1a1
h8h6
b7d7
e2a2
b3b7
d3g3
b3a5
e2b2
d7a7
e6g6
d6d4
a3e7
e7c8
f4g6
e6c8
d3d5
b2f6
f6g8
a7b8
c6e8
b3c1
c2a4
f1f5
b2d2
h8h4
a3c4
a6c4
h7f6
f4f6
f6d8
d5f7
e2e5
e5e2
e4g4
e8h8
c3e5
d2d5
c3c7
g7f5
a6d3
g4h6
f3h3
e5g7
h6f4
d3b3
g3e5
e2e6
a8a3
b6a4
b4c2
d5a5
b6c8
b7g2
f2h4
c2c7
d3b4
g3d6
f5h6
h4h6
b3a2
h1h4
f4e2
f1e3
a6c6
a8a4
d2a5
d4b4
f4h4
e4e1
g1h3
c4c1
e5b2
a3c3
d8e6
c3c1
e3c1
g4e4
c5c3
c4c6
h3f5
f3f6
a6b4
g4d1
a3d6
d7d3
b3e6
g8d8
e4c2
d5g2
a8b7
f2d4
c2g6
d5b3
c6f3
a7c7
f4d4
c5a6
e8f6
h6f6
b6d6
b2e5
d6f6
c2c8
d5b5
h2g4
e6c5
c6b8
g8g6
f5g3
d6a6
h3f3
e5f7
a3c5
e4h4
h3e6
f6d6
e5e8
h5g7
f7d7
g6e4
a5c3
b4b7
f8g6
d2d8
b1b6
h5f7
d6a3
c4a3
b1b4
d5d2
c4a4
e5c3
h2e5
b3e3
c4a5
d8h8
h4e7
f1f6
b6b3
c7c2
e6c7
d3f2
g3e3
d5d7
e6g5
c4f7
f7f8q
c7c1
h5e2
c3c5
h6f7
g3e2
e6e8
h4e4
a3c2
b3d3
a5a2
g5e5
e7b7
c5a4
d1e3
b7b8q
e5e1
g6h4
b7b3
c4c7
c7g3
b3b5
b5b7
g5h7
g4c8
e6a2
c5f8
g7b2
d7g7
a4a7
f1f7
b6f6
g4g6
b1b8
e3c3
c7g7
h1h7
h7f7
h5h3
f8f3
d5b7
c7c3
g7c3
h4h1
f4h6
a7a8q
f3h5
e6e1
d4d8
d4f2
c5c2
c1f1
d5d3
f7e5
d6d8
h2f3
e8h5
d4c2
b1b5
d6d2
a8h8
a2d2
e2e7
f5c8
f5d5
c6c2
a5d8
f6b2
b6f2
c6e6
d3h7
c2c1q
g2b7
c3a3
b4b6
e6e4
h6f5
e4c6
a4d1
f6c3
b2f2
f2d2
c6a7
e4e8
d3a6
a1h1
f3c6
c8g8
h6f8
d2a2
d2h6
e4g6
b5f1
f4g2
b6e6
d6b6
e4g2
f5h5
c8h3
g1g3
c7b5
e6d8
e8g6
d6b5
a4a1
e5e3
b2d3
c4b2
b6e3
g6d3
b2e2
d2d6
b2b6
a5a1
a3a1
e3e7
e3h3
e7e2
c5a3
g8c8
a2f2
e5b8
g1e1
f5f2
b8g8
c5b7
a2d5
g5d8
e8g7
f7f4
b2b5
a6e2
c6c8
b4d4
f3f7
a1g1
b1f1
e3g2
f7g5
a4a2
d6f7
a2a5
e1f3
e4f2
c1d3
h1c1
h1b1
f6h6
b2b1q
h1h6
f3d3
a5d2
h1h8
f5h3
c5a5
e4c4
h6e3
c6a6
a5a7
g1g4
f4f7
c2d4
g3g5
e4e7
h8b8
h7h8q
d4a4
h4g2
h2f4
d6b7
b7e7
c3g7
e8b5
f6f3
d5a8
b8e5
g1d1
c7e8
h8h2
g6g4
c4a2
f8f2
d6e8
e6g7
g8e8
e3e1
e1h1
e1g3
d6h2
g1c1
e8c7
b1d3
a5d5
e7e3
h7g5
h3f2
f2b2
d3e1
d6g6
g2e3
e2c1
a6a8
g8g3
f7h5
e3c2
b5e8
c3a5
a3b5
e7g7
c3a2
c6a4
d5d8
d3b2
f2b6
e1g2
f8d7
d7d1
a5b3
d3d7
d4d7
a3e3
e6e2
f5f7
d2d1q
g4g2
c8d6
e3b3
c2a2
e7a7
d3d6
h6g4
d6b8
b8b1
c5c8
b5b8
c4c8
d3c1
f7f3
f5g7
b5d5
e1b4
f6a6
a3d3
b6a7
h8h3
f2d3
c3c8
g6e6
e6h3
e1c3
f4f2
h4f2
a3c1
b7g7
d2g2
g4f2
g5h3
e3e6
f7h7
a2c4
e6e3
e4e6
b5a7
h6h8
a4d4
a7c5
g3g6
c1b3
g2f4
a7d4
f7c7
c8b6
e2a6
c5c1
c7a6
g8g5
e2g2
h3f1
b7c5
h2f2
a7g7
h7d3
a6e6
b5b2
g5c1
b8d6
g3d3
c7c8q
c8e7
f7d6
c6c3
h5e8
b3f3
f3b7
a4a8
d3d1
a3a5
e7e8q
f6f8
d3a3
e3a3
b7a5
d4g4
g3g7
g4d7
f5f3
e6c6
d3h3
c3a1
g4g7
f7b7
g6f8
a4a6
h3h5
c2b4
a6d6
e7h7
f4c1
b6a8
f2h2
h6h3
c4f1
d5h5
h6d2
g6e8
h3g5
h6h4
a2e6
d2b1
a6a4
a7e7
f7d5
g8g2
b8h8
g3e1
h7f5
b2g7
a4b2
d5g5
d2d7
b1h1
c7d5
e1h4
h5h7
d7h3
d7d8q
f1f8
f3b3
a6a1
g4h2
f1a6
h3h1
b4f4
g6g3
b4e4
c3f3
a1e5
g1g7
b7f7
b7b4
c4a6
d4d1
h8a8
e2e1q
f2c5
d6c8
c6g2
g3c7
a7a1
g8g4
f6f2
g4g1
g5d5
g7d7
b5a3
e5h2
a5e1
h4d4
f8h7
a5e5
d1c3
a6a3
f7f2
f2f5
a6f1
e4b4
a7f7
d3d8
b4a6
f8a3
a2e2
g2a2
a3f3
e7g8
g1g6
b2b7
e2h2
h2h7
g1a1
a7d7
f4c4
e8a4
e5h5
b1e4
h5d1
d4a1
b7d6
b5b1
b8b3
g5g7
a7a4
f6c6
b8f8
b4b8
b7b2
h3e3
b5b3
b4e1
a3f8
h7e4
f3g1
a7a2
g7g4
e5a5
f2c2
f2a2
b3b1
a5f5
b3f7
h4e1
b4b1
g5g2
h3h6
h3h7
d6h6
f3c3
c3f6
f2f8
f1h2
f4f1
f5b1
f2g4
g3f1
e6h6
c6g6
e2g1
d6d1
h4d8
e6f8
e6a6
f1d2
g8a8
d4a7
c3c6
g3c3
f6a1
a4f4
b1g1
a2b4
h3d3
f4b4
f2f1q
e7e1
f2f7
e5c5
g2b2
h2h5
c1h1
b2c4
a2a6
g7e6
h6d6
d2h2
g2h4
g5g3
f3f8
g7a1
a6f6
f8f1
c1g1
g2e2
c7a8
h7c2
c3e1
c4g4
a3a8
a3g3
h4h2
c2h2
h1e4
a5a8
e1c2
c6a8
f4b8
a4d7
c5f5
a7c6
g2a8
g1g5
c3g3
a1d4
b5e5
a8c6
b6b1
e4b1
g5c5
c8h8
e7e4
b7d8
g2e1
b3a1
f3a8
d1f2
c2a3
h5e5
e4a4
h4h7
b5f5
g1c5
h5h8
a4e4
d6d3
a6a2
a2g2
h1h5
c2g2
h2d2
d8c6
b4f8
h2b2
h6e6
e6b6
f5b5
c4f4
a7c8
g8d5
g3g1
f3f1
c1e2
a7a3
h5d5
d8f7
f3h1
f5f8
b3b8
f6b6
h8h1
f5f1
c6c1
g7h5
g7g3
f7h6
a2a7
h5c5
c5g5
a3a6
f2f6
a8d5
g2g1q
d5a2
h7c7
f5c5
d7d2
g4d4
a4g4
b4a2
a2c3
c6f6
g1g8
h8f6
h8d4
h2e2
d7h7
e4h7
g7e7
g6b6
a3a7
h4h8
h7f8
a6b8
e5a1
h8e5
h6c1
h4c4
g4c4
h7a7
a8b6
b8f4
h2d6
f4a4
g7g2
g3g8
a3h3
c2e1
c5g1
h1f3
e6g8
a3b1
g5b5
h5h1
a1f6
d5g8
a1c3
e3d1
g2d2
g3b3
f2a7
g7e8
h2a2
g6c2
b1g6
g6g8
h4a4
b2g2
b2a4
e3f1
g8b8
b2b8
f2h3
g7b7
g6g1
b6g6
a8f3
g2g8
c6h6
f7d8
a1g7
f2h1
g3b8
a7e3
g8g1
a2h2
g2g5
h3h8
h7h1
b4h4
g7a7
h6c6
e2e8
a5g5
h7h4
a5h5
g2g6
e1a5
f2e4
h5h2
g6d6
h2f1
c7h7
d5h1
a8e4
h7b7
g5g8
g8e6
g3h1
h3d7
g4a4
h6h1
h3g1
a2a8
b7h7
b3g3
e4a8
g1e3
a7b5
g1b1
a1c2
f7c4
a6g6
h7d7
h3a3
h6b6
e5h8
h7h3
g2c2
c4h4
g3a3
h6g8
g2g7
h6h2
h7e7
f4f8
f7f1
f6h8
g8c4
c2a1
a8g2
h5b5
g6g2
h7h2
e3g1
a7g1
c3h3
b5h5
b1f5
d4g1
c6h1
b7b1
e5b5
g7c7
b6h6
g7g1
b5g5
e3e8
g6c6
b2h2
b6g1
f7h8
f7b3
g6h8
h1g3
c7h2
h3c3
a4e8
g5g1
c4g8
d4h8
a7f2
a4h4
a7h7
b4g4
e4h1
f7a7
h2c2
c5h5
f5a5
g5a5
g6b1
h6a6
d8b7
c3h8
f2d1
f3a3
a2c1
h2h6
g4g8
b2d1
g4b4
g1d4
b8g3
a2g8
h2h8
h2c7
h5a5
h1d5
g6a6
f6f1
h1b7
a8h1
h3c8
h2b8
b3g8
c7d8q
a8c7
h8c3
c2h7
a1h8
h4b4
d1b2
a2f7
a1b3
g7f8q
h8f7
b3h3
e7f8q
a6h6
c1a2
